tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/turbulent/1_Inlet_2_Outlet/porosityBased/BP/uniformity-losses/0/Ua
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ua;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontBack
    {
        type            empty;
    }

    designWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    IEntranceWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    OEntranceWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    OREntranceWall  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet  
    {
        type            adjointInletVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            adjointOutletVelocityFlux;
        value           uniform (0 0 0);
    }
    
    outlet-right
    {
        type            adjointOutletVelocityFlux;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
